# Напишите программу вычисления значения функции   F (a,b)= 3 * (a + b) ** 3 + 275 * b ** 2 - 127 * a - 41
a = int(input())
b = int(input())
F = 3 * (a + b) ** 3 + 275 * b ** 2 - 127 * a - 41
print(F)