# Напишите программу, которая определяет наименьшее из четырёх чисел.

a = int(input())
b = int(input())
c = int(input())
d = int(input())
N = [a, b, c, d]
print(min(N))